app/Http/Controllers/FileController.php

select * from `tmb_products` where `collection_id` = 'a8c07ecb-356f-4ed7-aff4-f38ea4b74613'
---
    public function products($file_id)
    {
        $products = Product::where('collection_id', $file_id)->get();