app/Http/Controllers/WorkspaceController.php

    public function teams($workspace_id)
    {
        $teams = Team::where('workspace_id', $workspace_id)->get();
---
select * from `tmb_teams` where `workspace_id` = '9626a108-51ab-4149-9265-15fd6d42a3e9'

    public function files($workspace_id)
    {
        $files = Collection::where('workspace_id', $workspace_id)->with('products')->get();
---
select * from `tmb_collections` where `workspace_id` = '9626a108-51ab-4149-9265-15fd6d42a3e9'
select * from `tmb_products` where `tmb_products`.`collection_id` in ('a8c07ecb-356f-4ed7-aff4-f38ea4b74613')

    public function phases($workspace_id)
    {
        $phases = Phase::where('workspace_id', $workspace_id)->get();
---
select * from `tmb_phases` where `workspace_id` = '9626a108-51ab-4149-9265-15fd6d42a3e9'

    public function phaseTeams($workspace_id)
    {
        $phaseTeams = PhaseTeam::whereHas('phase', function (Builder $query) use($workspace_id) {
            $query->where('workspace_id', $workspace_id);
        })->get();
---
select * from `tmb_phases` where `workspace_id` = '9626a108-51ab-4149-9265-15fd6d42a3e9'